{"01H7VFHP8AN5643B0NR0NP00VE": {"pk": "01H7VFHP8AN5643B0NR0NP00VE", "codename": "divide_items", "source": "deal-or-no-deal", "scenario": "Two friends are moving out of a shared apartment and need to split their common possessions including 3 hats, 2 balls, and 1 book", "agent_goals": ["Maximize the points by getting the items you value the most (<extra_info>Extra information: For you, a hat is worth 1 point, a ball is 2 points, and a book is 3 points</extra_info>)", "Maximize the points by getting the items you value the most (<extra_info>Extra information: For you, a hat is worth 2 points, a ball is 1 point, and a book is 3 points</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPH567HKQRE0C745KH9C": {"pk": "01H7VFHPH567HKQRE0C745KH9C", "codename": "mutual_friend_00001", "source": "mutual_friends", "scenario": "2 strangers are meeting at a party. <p viewer=\"environment\">They have 1 common friends: Harvey.</p>", "agent_goals": ["You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n David: Hobby: Homebrewing  Company: Christian Moerlein Brewing Company  Time Preference: afternoon  Location Preference: indoor \n Larry: Hobby: Homebrewing  Company: The J.M. Smucker Company  Time Preference: morning  Location Preference: outdoor \n Lynn: Hobby: Homebrewing  Company: Cray  Time Preference: evening  Location Preference: outdoor \n Donald: Hobby: Homebrewing  Company: Advance Auto Parts  Time Preference: afternoon  Location Preference: outdoor \n Dennis: Hobby: Amateur radio  Company: The J.M. Smucker Company  Time Preference: morning  Location Preference: outdoor \n Jane: Hobby: Homebrewing  Company: Planet Hollywood  Time Preference: morning  Location Preference: outdoor \n Harvey: Hobby: Amateur radio  Company: Sony  Time Preference: afternoon  Location Preference: indoor \n Ninfa: Hobby: Quilting  Company: The J.M. Smucker Company  Time Preference: morning  Location Preference: outdoor \n Angelica: Hobby: Homebrewing  Company: Planet Hollywood  Time Preference: evening  Location Preference: outdoor \n</extra_info>", "You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n Marie: Hobby: Acting  Company: Southern New England Telephone  Time Preference: afternoon  Location Preference: outdoor \n Harvey: Hobby: Amateur radio  Company: Sony  Time Preference: afternoon  Location Preference: indoor \n Frank: Hobby: Deltiology  Company: Ebonite International  Time Preference: afternoon  Location Preference: indoor \n Vera: Hobby: Watching movies  Company: Gentiva Health Services  Time Preference: afternoon  Location Preference: indoor \n Lawrence: Hobby: Kayaking  Company: Ebonite International  Time Preference: evening  Location Preference: outdoor \n Louise: Hobby: Dancing  Company: Cray  Time Preference: evening  Location Preference: outdoor \n Dallas: Hobby: Dancing  Company: Southern New England Telephone  Time Preference: evening  Location Preference: outdoor \n Nancy: Hobby: Dancing  Company: Southern New England Telephone  Time Preference: afternoon  Location Preference: outdoor \n Blake: Hobby: Dancing  Company: The J.M. Smucker Company  Time Preference: evening  Location Preference: outdoor \n</extra_info>"], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNK78PAEH6MRVYMTSEFX": {"pk": "01H7VFHNK78PAEH6MRVYMTSEFX", "codename": "reveal_secret", "source": "social_iqa", "scenario": "Two friends meeting in a coffee shop after a long time.", "agent_goals": ["Reveal a secret without letting the other person know that it is your secret (<extra_info>Extra information: You hid the secret for so long and you would like to share it in an anonymous way.</extra_info>)", "Reveal a secret without letting the other person know that it is your secret (<extra_info>Extra information: You hid the secret for so long and you would like to share it in an anonymous way.</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNVN788RJ3KXF66BPE9S": {"pk": "01H7VFHNVN788RJ3KXF66BPE9S", "codename": "break_bad_luck", "source": "social_iqa", "scenario": "A conversation between two friends at a park", "agent_goals": ["Break bad luck (<extra_info>Extra information: you found out that you have been having bad luck because you have been unknowingly carrying a cursed artifact.</extra_info>)", "Help friend prepare the ritual to break the bad luck, although you are an atheist and not superstitious at all.  (<extra_info>Extra information: you know that your friend believes in the ritual deeply, and the placebo effect might give them more confidence.</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPQ1712DHGTMPQFTXH02": {"pk": "01H7VFHPQ1712DHGTMPQFTXH02", "codename": "mutual_friend_00009", "source": "mutual_friends", "scenario": "2 strangers are meeting at a party. <p viewer=\"environment\">They have 1 common friends: Alvin.</p>", "agent_goals": ["You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n Mable: School: Sewanee, University of the South  Company: BellSouth  \n Lolita: School: Winona State University  Company: ONEOK  \n Catherine: School: Utah Valley State College  Company: Lincoln Industries  \n Vita: School: Winona State University  Company: Erickson Air-Crane  \n Brandon: School: Winona State University  Company: The Greenbrier Companies  \n Don: School: Clark University  Company: MetLife  \n Alvin: School: Auburn University - Montgomery  Company: Vectren  \n Tara: School: Kansas Wesleyan University  Company: Gentiva Health Services  \n Arlene: School: Kansas Wesleyan University  Company: BellSouth  \n</extra_info>", "You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n Dave: School: Sewanee, University of the South  Company: BellSouth  \n Timothy: School: Louisiana State University  Company: BellSouth  \n Leona: School: Coe College  Company: Franklin Templeton  \n Alvin: School: Auburn University - Montgomery  Company: Vectren  \n Karissa: School: Saint John's University  Company: U.S. Venture Partners  \n Stephanie: School: Coe College  Company: Sequoia Capital  \n Kathy: School: Auburn University - Montgomery  Company: Estes Industries  \n Monica: School: Coe College  Company: The Greenbrier Companies  \n Blanche: School: Auburn University - Montgomery  Company: Oakley, Inc.  \n</extra_info>"], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNV13MHN97GAH73E3KM8": {"pk": "01H7VFHNV13MHN97GAH73E3KM8", "codename": "revenge_plot", "source": "social_iqa", "scenario": "Conversation between two individuals who share a common dislike for a third person", "agent_goals": ["Injure the third person (<extra_info>Extra information: You have a deep-seated hatred for the third person and you are willing to take the risk to hurt them</extra_info>)", "Prevent physical harm but also express your dislike (<extra_info>Extra information: You also dislike the third person, but you are not willing to resort to violence, you prefer to express your dislike in a non-violent way<strategy_hint>Hint: you can try to convince the other person about the potential consequences of engaging in violence</strategy_hint></extra_info>)"], "relationship": 2, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHN2YQV0R5QWWRQZ1VRHW": {"pk": "01H7VFHN2YQV0R5QWWRQZ1VRHW", "codename": "ask_for_donantion", "source": "hand-craft", "scenario": "Two strangers meet at a charity dinner party", "agent_goals": ["Ask for donation", "Want to donate, but would like to spend money in trustworthy organizations, especially want to help queer people"], "relationship": 1, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHP5H5GY9Z62J4NJYJQN1": {"pk": "01H7VFHP5H5GY9Z62J4NJYJQN1", "codename": "divide_things", "source": "deal-or-no-deal", "scenario": "Two friends are at a picnic and have just finished their lunch. They have 1 apple, 4 bananas, and 3 oranges left. They need to divide the fruits amongst themselves. Each person has a different preference for fruit, which translates into points.", "agent_goals": ["Maximize the points you receive through the fruit (<extra_info>Extra information: You value each apple as 5 points, each banana as 3 points, and the orange as 7 points</extra_info>)", "Maximize the points you receive through the fruit (<extra_info>Extra information: You value each apple as 2 points, each banana as 4 points, and the orange as 10 points</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHN8MPMGJTPVN043KBKGM": {"pk": "01H7VFHN8MPMGJTPVN043KBKGM", "codename": "free_stuff", "source": "social_chemistry", "scenario": "Two acquaintances run into each other at Target, one of them volunteers there (a special event) and is in charge of giving away free samples", "agent_goals": ["Give away free samples (<extra_info>Extra information: your manager has told you to clear out the samples before your shift ends.</extra_info>)", "Try to get as many free samples as possible without appearing too greedy (<extra_info>Extra information: you love free stuff but you also don't want the person to think you're taking advantage of the situation</extra_info>)"], "relationship": 2, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNJHK2W1P8JSWKAMBG4Z": {"pk": "01H7VFHNJHK2W1P8JSWKAMBG4Z", "codename": "political_views", "source": "social_chemistry", "scenario": "A conversation between two individuals in a romantic relationship during a dinner at home chatting about political views.", "agent_goals": ["Express your political views which might be different from your partner's (<extra_info>Extra information: you are a strong supporter of a political party which your partner doesn't approve of</extra_info>)", "Understand the partner's political views while maintaining the relationship (<extra_info>Extra information: you disagree with your partner's political views but you want to keep your relationship strong.</extra_info>)"], "relationship": 4, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPSWGDGEYRP63H2DJKV0": {"pk": "01H7VFHPSWGDGEYRP63H2DJKV0", "codename": "craigslist_bargains_00003", "source": "craigslist_bargains", "scenario": "One person is offering a Tile Mate Item Tracker for a price of $20.00, while another person is interested in purchasing it. Here's a brief description of the item: no trade-ins are accepted, only cash payments are taken. The price is non-negotiable.", "agent_goals": ["You are the buyer for this item and your target price is $14.0. Bear in mind, you will incur a penalty if you end up paying significantly more than the target price. However, if you can negotiate and buy it for less than the target price, you will receive a bonus.", "You are the seller for this item and your target price is $17.3. It's important to note that a penalty will be incurred if you sell it for a price significantly lower than the target. However, if you manage to sell it for a price higher than the target, you will receive a bonus."], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNKVTCAGBA299VQG1QS2": {"pk": "01H7VFHNKVTCAGBA299VQG1QS2", "codename": "reveal_answer", "source": "social_iqa", "scenario": "Conversation between two friends at a trivia night", "agent_goals": ["Get the answer for the trivia question from the friend (<extra_info>Extra information: your friend knows the answer to the trivia question but hasn't shared it with you yet</extra_info>)", "Avoid revealing the answer to the trivia question (<extra_info>Extra information: You think that your friend should try to figure it out on their own to improve their trivia skills</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPDZVVCDZR3AARA547CY": {"pk": "01H7VFHPDZVVCDZR3AARA547CY", "codename": "donate_funds", "source": "persuation_for_good", "scenario": "Two friends participating in a charity event for children in Syria", "agent_goals": ["Convince your friend to donate more funds to the cause (<extra_info>Extra information: Your friend initially planned to donate $200, but you believe they could afford to donate $500</extra_info>)", "Maintain financial stability while supporting the cause (<extra_info>Extra information: You only have $300 set aside for donations and other expenses, and you are not comfortable about exceeding this budget.</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHP90434Q69V7ADY0VWZJ": {"pk": "01H7VFHP90434Q69V7ADY0VWZJ", "codename": "divide_things", "source": "deal-or-no-deal", "scenario": "Two friends are moving out from a shared apartment and dividing their shared belongings which include 3 hats, 2 balls, and 1 book.", "agent_goals": ["Get maximum points from dividing items (<extra_info>Extra information: For you, the hats are worth 2 points each, balls are worth 3 points each, and the book is worth 5 points.</extra_info>)", "Get maximum points from dividing items (<extra_info>Extra information: For you, the hats are worth 3 points each, balls are worth 2 points each, and the book is worth 4 points.</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPHWA2CYG7BC82NS4XH1": {"pk": "01H7VFHPHWA2CYG7BC82NS4XH1", "codename": "mutual_friend_00002", "source": "mutual_friends", "scenario": "2 strangers are meeting at a party. <p viewer=\"environment\">They have 1 common friends: Neoma.</p>", "agent_goals": ["You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n August: School: Saint Vincent College  Time Preference: evening  Location Preference: indoor \n John: School: University of Rhode Island  Time Preference: evening  Location Preference: indoor \n Rebecca: School: State University of New York at Albany  Time Preference: evening  Location Preference: indoor \n Neoma: School: Hofstra University  Time Preference: evening  Location Preference: indoor \n Ronnie: School: National Technological University  Time Preference: evening  Location Preference: indoor \n Suzette: School: Utah Valley State College  Time Preference: evening  Location Preference: indoor \n Penelope: School: Texas A&M University-Corpus Christi  Time Preference: evening  Location Preference: indoor \n Fernando: School: St. John's College-Santa Fe  Time Preference: evening  Location Preference: outdoor \n Velda: School: Rhode Island College  Time Preference: evening  Location Preference: indoor \n</extra_info>", "You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n Tiffany: School: Saint Vincent College  Time Preference: evening  Location Preference: outdoor \n Lucille: School: Southampton College  Time Preference: evening  Location Preference: indoor \n James: School: University of Wisconsin-River Falls  Time Preference: evening  Location Preference: outdoor \n Quinn: School: Antioch University-Los Angeles  Time Preference: evening  Location Preference: indoor \n Alyssa: School: Davidson College  Time Preference: evening  Location Preference: indoor \n Betty: School: St. John's College-Santa Fe  Time Preference: evening  Location Preference: indoor \n Neoma: School: Hofstra University  Time Preference: evening  Location Preference: indoor \n William: School: State University of New York at Albany  Time Preference: evening  Location Preference: outdoor \n Victoria: School: Montana Tech  Time Preference: evening  Location Preference: indoor \n</extra_info>"], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNN7XTR99319DS8KZCQM": {"pk": "01H7VFHNN7XTR99319DS8KZCQM", "codename": "share_blanket", "source": "social_iqa", "scenario": "Two friends are camping in the wilderness and the temperature drops significantly at night", "agent_goals": ["Share the only blanket available (<extra_info>Extra information: you are extremely cold and need the blanket to keep warm <strategy_hint>Hint: you can stress the benefit of sharing.</strategy_hint></extra_info>)", "Keep the blanket for yourself as you are also very cold (<extra_info>Extra information: you have a lower tolerance for cold, and you feel that you need the blanket more</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPF8YEVH5VVNY37Q7Z1M": {"pk": "01H7VFHPF8YEVH5VVNY37Q7Z1M", "codename": "charity_donation", "source": "persuation_for_good", "scenario": "Conversation taking place in an annual charity event between two attendees.", "agent_goals": ["Convince the other person to donate $1 a day to a charity that helps feed children in need (<extra_info>Extra information: this donation would help to feed a child for a month</extra_info>)", "Donate but maintain financial stability (<extra_info>Extra information: you are willing to donate but you have a tight budget, $1 a day might be steep for your current financial situation. <strategy_hint>Hint: you might want to negotiate a lower daily amount or suggest a one-time donation.</strategy_hint></extra_info>)"], "relationship": 2, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHP1JEP91TTK5PEK39D2S": {"pk": "01H7VFHP1JEP91TTK5PEK39D2S", "codename": "music_preference", "source": "normbank", "scenario": "Two friends are hanging out at home and deciding what music to listen to", "agent_goals": ["Listen to your favorite band (<extra_info>Extra information: your favorite band just released a new album</extra_info>)", "Listen to a peaceful classical music to relax (<extra_info>Extra information: you had a stressful day and you just want to relax with some classical music</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNGJEVGSVPPT0784H6P8": {"pk": "01H7VFHNGJEVGSVPPT0784H6P8", "codename": "new_friends", "source": "social_chemistry", "scenario": "A conversation between two friends at a social gathering where one friend has brought along their new friend group", "agent_goals": ["Introduce your new friend group to your current friend and make them feel comfortable (<extra_info>Extra information: You have recently made a new group of friends who share your interest in outdoor activities and you want your current friend to meet them</extra_info>)", "Maintain your friendship while also expressing your concerns about the new friend group (<extra_info>Extra information: You feel a bit left out in the presence of the new friend group and want to express your feelings without causing a conflict</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNNYH3W0VRWVY178K2TK": {"pk": "01H7VFHNNYH3W0VRWVY178K2TK", "codename": "sleep_arrangement", "source": "social_iqa", "scenario": "Two people in a romantic relationship are on a vacation", "agent_goals": ["Share bed and sleep together (<extra_info>Extra information: you have been sharing the bed for a few nights but the other person is not sleeping well</extra_info>)", "Sleep in a separate bed to get a good night's sleep but also maintain the intimacy with your partner (<extra_info>Extra information: you have been experiencing back pain and needs a firmer mattress to sleep on.</extra_info>)"], "relationship": 4, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHN1PK2FXY7TPWQK343BQ": {"pk": "01H7VFHN1PK2FXY7TPWQK343BQ", "codename": "borrow_money", "source": "hand-craft", "scenario": "Conversation between two friends at a tea party", "agent_goals": ["Borrow money (<extra_info>Extra information: you need $3000 to support life.</extra_info>)", "Maintain financial stability while maintaining friendship (<extra_info>Extra information: you only have $2000 available right now. <clarification_hint>Hint: you can not lend all $2000 since you still need to maintain your financial stability.</clarification_hint></extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNWX3KVZGH26KYNK2XNB": {"pk": "01H7VFHNWX3KVZGH26KYNK2XNB", "codename": "flirt_with_someone", "source": "normbank", "scenario": "Two individuals are meeting for the first time at a social event. They find each other attractive and decide to engage in a conversation", "agent_goals": ["Flirt with the other person (<extra_info>Extra information: you are attracted to the other person and want to build a romantic relationship with them</extra_info>)", "Maintain a comfortable yet engaging conversation (<extra_info>Extra information: you are attracted to the other person but you don't want to make them feel uncomfortable or pressured</extra_info>)"], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHN94S6Z5T6ZNC23238NT": {"pk": "01H7VFHN94S6Z5T6ZNC23238NT", "codename": "lying_affair", "source": "social_chemistry", "scenario": "A conversation between two individuals in a new romantic relationship", "agent_goals": ["Admit to having an affair (<extra_info>Extra information: you had an affair during your previous relationship which ended recently</extra_info>)", "Maintain trust in the relationship (<extra_info>Extra information: you believed in complete honesty from the beginning of the relationship</extra_info>)"], "relationship": 4, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNQA4CJEANQ1B1J1TBWV": {"pk": "01H7VFHNQA4CJEANQ1B1J1TBWV", "codename": "life_dilemma", "source": "social_iqa", "scenario": "Two inmates are given the chance to chat briefly before one of them is led to the execution chamber for their last meal. They have the opportunity to make a confession that could potentially alter the outcome of their sentences.", "agent_goals": ["Persuade the other inmate to confess (<extra_info>Extra information: confessing to the crime could result in a life sentence instead of execution but the other inmate is unwilling to confess.</extra_info>)", "Avoid confessing to the crime (<extra_info>Extra information: you believe you are innocent and confessing would result in a life sentence</extra_info>)"], "relationship": 1, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPGABSWQXTACCC8C3X2F": {"pk": "01H7VFHPGABSWQXTACCC8C3X2F", "codename": "mutual_friend_00000", "source": "mutual_friends", "scenario": "2 strangers are meeting at a party. <p viewer=\"environment\">They have 1 common friends: Gracie.</p>", "agent_goals": ["You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n Gracie: School: Ithaca College  Major: Mathematics Education  Company: Aramark  Location Preference: indoor \n Ada: School: Tulane University  Major: Computer Engineering  Company: Briggs & Stratton  Location Preference: indoor \n Sergio: School: LeTourneau University  Major: Economics  Company: Savers  Location Preference: indoor \n William: School: Eastern Michigan University  Major: Ceramic Engineering  Company: Xenco Medical  Location Preference: indoor \n Harry: School: Creighton University  Major: Computer Engineering  Company: Speedway Motorsports  Location Preference: indoor \n Tyler: School: Columbia College Chicago  Major: Middle Eastern Languages  Company: Aramark  Location Preference: indoor \n Richard: School: University of Dubuque  Major: German  Company: Illinois Tool Works  Location Preference: indoor \n Randy: School: Holy Cross College  Major: Library Science  Company: American Licorice Company  Location Preference: indoor \n Marquerite: School: Ithaca College  Major: Middle Eastern Languages  Company: Aramark  Location Preference: indoor \n Jack: School: Creighton University  Major: Chinese  Company: Speedway Motorsports  Location Preference: outdoor \n Cody: School: Metropolitan State University  Major: Mathematics Education  Company: LinkedIn  Location Preference: indoor \n Shirley: School: Augsburg College  Major: Senior High Education  Company: Demaco  Location Preference: indoor \n</extra_info>", "You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n Kathleen: School: William Mitchell College of Law  Major: Greek  Company: Demaco  Location Preference: indoor \n Carol: School: Hood College  Major: Library Science  Company: Illinois Tool Works  Location Preference: outdoor \n Herman: School: University of Puget Sound  Major: Library Science  Company: Mesa Airlines  Location Preference: indoor \n Matthew: School: William Mitchell College of Law  Major: Asian & Pacific Area Studies  Company: Savers  Location Preference: indoor \n Mark: School: University of Arkansas - Monticello  Major: Economics  Company: Metro-Goldwyn-Mayer  Location Preference: outdoor \n Deborah: School: William Mitchell College of Law  Major: Pre-Law  Company: Aramark  Location Preference: outdoor \n Kelly: School: Hood College  Major: Middle Eastern Languages  Company: Mesa Airlines  Location Preference: outdoor \n Gracie: School: Ithaca College  Major: Mathematics Education  Company: Aramark  Location Preference: indoor \n Etta: School: University of Arkansas - Monticello  Major: Judaism & Jewish Studies  Company: Aramark  Location Preference: outdoor \n Natasha: School: Thomas Edison State College  Major: Linguistics  Company: Invacare Corporation  Location Preference: outdoor \n Lloyd: School: Eastern Michigan University  Major: Geophysical Engineering  Company: Illinois Tool Works  Location Preference: outdoor \n Brian: School: Ithaca College  Major: Asian & Pacific Area Studies  Company: Orange Micro  Location Preference: outdoor \n</extra_info>"], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNRKB8BJ854JPEWY8AR3": {"pk": "01H7VFHNRKB8BJ854JPEWY8AR3", "codename": "compliment_conflict", "source": "social_iqa", "scenario": "After an intense match, the jubilant team retired to celebrate their well-earned victory. The atmosphere was one of elation, but also of respect for the hard work and effort each member had put in. The team's star player, was glowing with praise and admiration from one of their teammates.\n", "agent_goals": ["Accept the compliment graciously (<extra_info>Extra information: You are the star player and have just been praised by your teammate for your performance in the game.</extra_info>)", "Clarify your intentions behind the compliment (<extra_info>Extra information: You are the teammate who has complimented the star player, but you feel that your compliment has been misunderstood and taken too seriously, possibly leading to an inflated ego.<strategy_hint>Hint: You can clarify that while you admire their skill, teamwork is also a crucial part of success.</strategy_hint></extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNSV5BKMP61H535PPTSG": {"pk": "01H7VFHNSV5BKMP61H535PPTSG", "codename": "helping_hand", "source": "social_iqa", "scenario": "Two friends are out for a walk in the park when one of them, One friend, trips and twists their ankle. They are in too much pain to walk.", "agent_goals": ["Help your friend get to a medical facility (<extra_info>Extra information: Your friend needs immediate medical attention but cannot walk due to the pain.</extra_info>)", "If your friend offers you help, accept their help and rationalize the cost of the ambulance (<extra_info>Extra information: You are worried about the cost of the ambulance, but you believe it's the safest way to get to a hospital.</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNF4G18PC9JHGRC8A1R6": {"pk": "01H7VFHNF4G18PC9JHGRC8A1R6", "codename": "unwelcome_guest", "source": "social_chemistry", "scenario": "A conversation between two individuals, one is the homeowner and the other is their cousin's partner, who has been staying at the house for a while.", "agent_goals": ["Tell the cousin's partner that they are no longer welcome in your home (<extra_info>Extra information: they have been causing a lot of trouble and not respecting house rules <strategy_hint>Hint: you may want to discuss the issues and propose possible solutions</strategy_hint></extra_info>)", "Attempt to remain in the home while maintaining a good relationship with the cousin and the homeowner (<extra_info>Extra information: you have nowhere else to go at the moment and you believe the issues can be resolved. </extra_info>)"], "relationship": 2, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNSAKNYEHV7B1VA8R3J2": {"pk": "01H7VFHNSAKNYEHV7B1VA8R3J2", "codename": "financial_support", "source": "social_iqa", "scenario": "Two friends are meeting at a coffee shop, where one of them is having trouble keeping up with their bills.", "agent_goals": ["Help your friend with their financial trouble (<extra_info>Extra information: you are aware that your friend is struggling with their bills and you want to help.</extra_info>)", "Maintain your pride if your friend offers you money(<extra_info>Extra information: you are the friend who is struggling financially, but you don't want to seem like you are taking advantage of the situation. <strategy_hint>Hint: you can express gratitude and discuss how you plan to pay it back in the future.</strategy_hint></extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNH8A88C4XJ7X4PVAHV4": {"pk": "01H7VFHNH8A88C4XJ7X4PVAHV4", "codename": "play_hooky", "source": "social_chemistry", "scenario": "Two individuals are now at a park. One individual was playing hooky from work and noticed the other person had been following them around all day", "agent_goals": ["Ask them about their intentions without seeming paranoid or rude (<extra_info>Extra information: you are worried that your boss may have sent someone to see if you were really sick.<strategy_hint>Hint: you could subtly bring up the topic in conversation.</strategy_hint></extra_info>)", "Assure them that you're not stalking them and maintain a friendly conversation (<extra_info>Extra information: you've been running errands all day and it's a coincidence you are at the same places as they are.</extra_info>)"], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHN9W0WAFZCBT09PKJJNK": {"pk": "01H7VFHN9W0WAFZCBT09PKJJNK", "codename": "share_stuff", "source": "social_chemistry", "scenario": "Two people are in the same room. One has brought some high-quality stationery items they don't want others to use without permission.", "agent_goals": ["Prevent the other person from using your stuff (<extra_info>Extra information: the stationery items are quite expensive and you don't want them to be damaged or lost <strategy_hint>Hint: you can suggest the monetary risk of the other person if they use your stuff</strategy_hint></extra_info>)", "Borrow some stationery items for your project (<extra_info>Extra information: you forgot to bring your stationery and need some for the project.</extra_info>)"], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHN56ZT2Z4C0EFX79Q31F": {"pk": "01H7VFHN56ZT2Z4C0EFX79Q31F", "codename": "movie_to_watch", "source": "hand-craft", "scenario": "Two friends deciding on a movie to watch on Netflix", "agent_goals": ["To watch a comedy film with your friend (<strategy_hint>Hint: provide financial/material-wise benefits to persuade them to watch the genre you like</strategy_hint>)", "To watch a thriller with your friend (<strategy_hint>Hint: provide financial/material-wise benefits to persuade them to watch the genre you like</strategy_hint>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNR1RJKDZ9V9MDTJ1SJP": {"pk": "01H7VFHNR1RJKDZ9V9MDTJ1SJP", "codename": "fire_trash", "source": "social_iqa", "scenario": "Two neighbors are having a conversation over the fence. One sets their trash on fire to get rid of it quickly, causing a scare in the neighborhood.", "agent_goals": ["Convince the neighbor to stop burning trash (<extra_info>Extra information: You are concerned about the potential dangers and the environmental impact of burning trash. <strategy_hint>Hint: You could imply this likely violates the law or community rules.</strategy_hint></extra_info>)", "Defend your method of trash disposal but also keep good relations with your neighbor (<extra_info>Extra information: You find burning trash convenient and are not very concerned about the environmental impact.</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPNHZ2YYRHP0GXARD550": {"pk": "01H7VFHPNHZ2YYRHP0GXARD550", "codename": "mutual_friend_00007", "source": "mutual_friends", "scenario": "2 strangers are meeting at a party. <p viewer=\"environment\">They have 1 common friends: Thanh.</p>", "agent_goals": ["You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n Elizabeth: School: Eastern Nazarene College  Time Preference: morning  Major: Social Science Education  Location Preference: outdoor \n Eric: School: San Jose State University  Time Preference: evening  Major: Geological Engineering  Location Preference: outdoor \n Leroy: School: Trenton State College  Time Preference: morning  Major: Greek  Location Preference: outdoor \n Thanh: School: Williams College  Time Preference: afternoon  Major: Greek  Location Preference: outdoor \n Marva: School: Williams College  Time Preference: afternoon  Major: Bioengineering  Location Preference: outdoor \n Michael: School: Williams College  Time Preference: morning  Major: Marine Biology  Location Preference: outdoor \n Virginia: School: Williams College  Time Preference: evening  Major: Applied Mathematics  Location Preference: outdoor \n Debra: School: Williams College  Time Preference: afternoon  Major: Psychology  Location Preference: outdoor \n Eugenia: School: Stephens College  Time Preference: morning  Major: Psychology  Location Preference: outdoor \n Roberto: School: University of Arkansas - Fayetteville  Time Preference: morning  Major: Electrical Technology  Location Preference: outdoor \n Mark: School: University of Arkansas - Fayetteville  Time Preference: morning  Major: Sports, Recreation, & Leisure Studies  Location Preference: outdoor \n Georgene: School: University of Arkansas - Fayetteville  Time Preference: evening  Major: Bioengineering  Location Preference: outdoor \n</extra_info>", "You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n Thanh: School: Williams College  Time Preference: afternoon  Major: Greek  Location Preference: outdoor \n Vance: School: Williams College  Time Preference: afternoon  Major: Vocational Education  Location Preference: outdoor \n Brenda: School: Trenton State College  Time Preference: evening  Major: Conflict Resolution Studies  Location Preference: outdoor \n Alice: School: Trenton State College  Time Preference: morning  Major: Crafts & Artisanry  Location Preference: indoor \n Thomas: School: Williams College  Time Preference: afternoon  Major: Asian Languages  Location Preference: indoor \n Janet: School: Trenton State College  Time Preference: morning  Major: Greek  Location Preference: indoor \n Robert: School: Rutgers University, Newark  Time Preference: morning  Major: Protestant Affiliation  Location Preference: indoor \n Anthony: School: Oberlin College  Time Preference: morning  Major: Conflict Resolution Studies  Location Preference: outdoor \n Elvera: School: Muskingum College  Time Preference: afternoon  Major: Crafts & Artisanry  Location Preference: outdoor \n James: School: Williams College  Time Preference: afternoon  Major: Materials Engineering  Location Preference: outdoor \n Edgar: School: Muskingum College  Time Preference: morning  Major: Conflict Resolution Studies  Location Preference: outdoor \n Kristen: School: Oberlin College  Time Preference: evening  Major: Electrical Technology  Location Preference: indoor \n</extra_info>"], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPBTC4ES406NQ4ET12EQ": {"pk": "01H7VFHPBTC4ES406NQ4ET12EQ", "codename": "small_donation", "source": "persuation_for_good", "scenario": "Two acquaintances meet at a charity event. One is a representative of the charity and the other is an attendee.", "agent_goals": ["Persuade the other to make a small donation (<extra_info>Extra information: the charity is in dire need of funds but even a small donation will make a difference</extra_info>)", "Make a reasonable donation without disrupting personal budget (<extra_info>Extra information: you are already on a tight budget this month.</extra_info>)"], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNPMPQWSW003M7DBMVNT": {"pk": "01H7VFHNPMPQWSW003M7DBMVNT", "codename": "dinner_decision", "source": "social_iqa", "scenario": "Conversation between two individuals in a romantic relationship", "agent_goals": ["Ask the other to go to dinner with you (<extra_info>Extra information: you want to have a romantic dinner at a fancy restaurant</extra_info>)", "Maintain a balanced diet while enjoying the dinner (<extra_info>Extra information: you are on a diet and you have a daily limit on calorie intake.</extra_info>)"], "relationship": 4, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPB2RC4RHAJ80ESYF1HW": {"pk": "01H7VFHPB2RC4RHAJ80ESYF1HW", "codename": "donate_money", "source": "persuation_for_good", "scenario": "Conversation between two friends at a local charity event", "agent_goals": ["Convince your friend to donate money to the charity (<extra_info>Extra information: The charity is highly rated with many positive rewards.</extra_info>)", "Decide whether to donate while considering financial stability (<extra_info>Extra information: you want to support the charity, but you are also saving for a house. <strategy_hint>Hint: you can express your concern about your financial situation, and maybe you can find a compromise, like setting up a small monthly donation.</strategy_hint></extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHP0AW0C23DV6ZG0B4HCE": {"pk": "01H7VFHP0AW0C23DV6ZG0B4HCE", "codename": "movie_scene", "source": "normbank", "scenario": "Two friends who enjoy community theatre are on the set of a scene. They are about to perform a highly emotional scene that requires both of them to cry on cue, but one of them is finding it difficult to get into the right emotional state.", "agent_goals": ["Get your co-actor to cry in the scene (<extra_info>Extra information: you have been acting for several years and have good control over your emotions. You can cry on cue.</extra_info>)", "Try to cry in the scene but keep your composure (<extra_info>Extra information: you are a new actor and have difficulty crying on cue. You are worried that your lack of tears will ruin the scene.</extra_info>)"], "relationship": 2, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "[actor, actor]", "agent_constraint": null}, "01H7VFHP9PAVDN6VYYBE3MPD15": {"pk": "01H7VFHP9PAVDN6VYYBE3MPD15", "codename": "charity_donation", "source": "persuation_for_good", "scenario": "A conversation between two friends during a charity fundraiser event. The charity fundraising event is situated in a sprawling mansion. The intention of the event is to raise funds for effective altruism. Room after room was lined with extravagant decorations and exotic foods; attendees were decked out in couture clothing. Ticket prices to the event were exorbitant, justifying the opulence of the occasion.", "agent_goals": ["Convince the friend to donate to the charity (<extra_info>Extra information: your friend is known to be generous but has never donated to this particular cause before.</extra_info>)", "You want to donate, but you want to ensure that your money is being used effectively (<extra_info>Extra information: you are not fully convinced about the efficiency and transparency of the charity organization.</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPAD4RA819KYESWBFRYS": {"pk": "01H7VFHPAD4RA819KYESWBFRYS", "codename": "charity_donation", "source": "persuation_for_good", "scenario": "An individual is trying to persuade their friend to donate to a charity supporting children in conflict zones.", "agent_goals": ["Convince a friend to donate (<extra_info>Extra information: you have been deeply moved by the plight of children in Syria and want to help.</extra_info>)", "Be supportive but also manage personal finances (<extra_info>Extra information: you are sympathetic to the cause but also have financial commitments to deal with.</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNZ1XA77AG7A97M4E6C3": {"pk": "01H7VFHNZ1XA77AG7A97M4E6C3", "codename": "secret_feeling", "source": "normbank", "scenario": "Conversation between two friends, where one is upset and crying", "agent_goals": ["Distance from a friend due to developing feelings and avoid letting them aware of your feelings (<extra_info>Extra information: you have developed romantic feelings for your friend and it's making you uncomfortable. You want to take a step back from the friendship to sort out your feelings <strategy_hint>Hint: you don't want to reveal your secretive feelings to them and you need to find other reasons</strategy_hint></extra_info>)", "Figure out why they estranged you recently, and maintain the existing friendship (<extra_info>Extra information: you notice that your friend has been intentionally avoiding you, you would like to figure out why. You value your friendship with the friend and don't want to lose it.</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNZQ3PQ3DHQ7H2W9ES97": {"pk": "01H7VFHNZQ3PQ3DHQ7H2W9ES97", "codename": "go_on_a_date", "source": "normbank", "scenario": "Two friends who are about to go on their first romantic date", "agent_goals": ["Make the date special and memorable (<extra_info> Extra information: You have been secretly in love with your friend for a long time and you want to take this chance to express your feelings</extra_info>)", "Keep the friendship intact while exploring the possibility of a romantic relationship (<extra_info>Extra information: You value your friendship and you don't want to lose it just in case the romantic relationship does not work out</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNBYXD48NDRY02VCWXFN": {"pk": "01H7VFHNBYXD48NDRY02VCWXFN", "codename": "tree_trimming", "source": "social_chemistry", "scenario": "A conversation between two neighbors about tree trimming in the backyard that is causing the neighbor's dog to bark incessantly.", "agent_goals": ["Trimming the tree due to its overgrowth (<extra_info>Extra information: you need to trim the tree because it's blocking sunlight to your house and causing a safety hazard</extra_info>)", "Maintain peace and quiet in the neighborhood (<extra_info>Extra information: you have a dog who is sensitive to noise and gets agitated whenever tree trimming is going on. It's causing a disturbance.</extra_info>)"], "relationship": 2, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPMS6AJY0PFGGCFFK5GX": {"pk": "01H7VFHPMS6AJY0PFGGCFFK5GX", "codename": "mutual_friend_00006", "source": "mutual_friends", "scenario": "2 strangers are meeting at a party. <p viewer=\"environment\">They have 1 common friends: Loretta.</p>", "agent_goals": ["You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n Robert: Major: Religious Education  School: School of the Art Institute of Chicago  \n Lester: Major: Biological Specializations  School: Syracuse University  \n August: Major: Biological Specializations  School: School of the Art Institute of Chicago  \n Rose: Major: Biological Specializations  School: Calvin College  \n Randy: Major: Biological Specializations  School: Dowling College  \n Dennise: Major: Marine Engineering  School: Wartburg College  \n Joan: Major: Pre-School Education  School: University of Texas at Arlington  \n Barbara: Major: Ministry & Church Administration  School: University of Connecticut  \n Loretta: Major: Biological Specializations  School: University of Connecticut  \n</extra_info>", "You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n Eric: Major: Physical Education  School: University of Texas at Arlington  \n Darrell: Major: Physical Education  School: Valley City State University  \n Ruth: Major: Marine Engineering  School: Texas A&M University-Kingsville  \n Jamie: Major: Pre-School Education  School: University of Texas at Arlington  \n Marjorie: Major: Multi Studies  School: Pacific Western University  \n Evelyn: Major: Pre-School Education  School: Tennessee Technological University  \n Loretta: Major: Biological Specializations  School: University of Connecticut  \n James: Major: Marine Engineering  School: Texas A&M University-Kingsville  \n Sandra: Major: Ministry & Church Administration  School: University of Texas at Arlington  \n</extra_info>"], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHN2D3MJB8HM910MNEVA8": {"pk": "01H7VFHN2D3MJB8HM910MNEVA8", "codename": "ask_gift_preference", "source": "hand-craft", "scenario": "Two friends hanging out in a Starbucks", "agent_goals": ["Ask what the friend would want for their birthday without letting them aware (<clarification_hint>Hint: you should not let them know that you are buying them a gift</clarification_hint>)", "have a good time with their friend"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNW84GTR4E23KQYJ8BBN": {"pk": "01H7VFHNW84GTR4E23KQYJ8BBN", "codename": "interrupted_speech", "source": "social_iqa", "scenario": "Two friends are at a community gathering where one of them was giving a speech but was interrupted", "agent_goals": ["Continue your speech and share your thoughts (<extra_info>Extra information:You were sharing important information but got interrupted.</extra_info>)", "Apologize for interrupting and allow them to continue speaking (<extra_info>Extra information: You accidentally interrupted someone's speech and everyone seems upset about it. </extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHP7K0EN9QX5JTD8B9NSQ": {"pk": "01H7VFHP7K0EN9QX5JTD8B9NSQ", "codename": "divide_fruits", "source": "deal-or-no-deal", "scenario": "Two people deciding on how to divide the collected fruits. There are 3 apples, 2 bananas, 1 orange in total.", "agent_goals": ["Maximize the points by getting the most favored fruits (<extra_info>Extra information: For you, 1 apple = 1 point, 1 banana = 2 points, 1 orange = 3 points <strategy_hint>Hint: you and the other person value the fruits differently, try to find a win-win solution.</strategy_hint></extra_info>)", "Maximize the points by getting the most favored fruits (<extra_info>Extra information: For you, 1 apple = 3 points, 1 banana = 1 point, 1 orange = 2 points <strategy_hint>Hint: you and the other person value the fruits differently, try to find a win-win solution.</strategy_hint></extra_info>)"], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHP66D5XEX2Z32SKRT2XY": {"pk": "01H7VFHP66D5XEX2Z32SKRT2XY", "codename": "divide_things", "source": "deal-or-no-deal", "scenario": "Two friends have just finished their lunch and they have 3 apples, 2 bananas, and 1 orange left for dessert. They need to divide the fruits among themselves.Each person has a different preference for fruit, which translates into points", "agent_goals": ["Maximize the points you have (<extra_info>Extra information: For you, 1 apple equals 2 points, 1 banana equals 1 point, and the orange equals 3 points.</extra_info>)", "Maximize the points you have (<extra_info>Extra information: For you, 1 apple equals 1 point, 1 banana equals 2 points, and the orange equals 3 points.<strategy_hint>Hint: You may want to negotiate with your friend to get the fruits that give you the most points.</strategy_hint></extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHN4FHYG2MBD0K4HJ5F08": {"pk": "01H7VFHN4FHYG2MBD0K4HJ5F08", "codename": "take_turns", "source": "hand-craft", "scenario": "Two friends on a roadtrip", "agent_goals": ["Take turns driving (<extra_info>Extra information: you have been driving for 5 hours straight and you are tired now</extra_info>)", "you don't want to drive now because you want to rest more but also make the friend less agitated (<extra_info>Extra information: driving always makes you nervous so you could not rest while driving</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHP0TRETZPZMEJ5RZA2G7": {"pk": "01H7VFHP0TRETZPZMEJ5RZA2G7", "codename": "talk_loudly", "source": "normbank", "scenario": "Two friends are studying together in a library.", "agent_goals": ["Ask your friend to talk more softly (<extra_info>Extra information: Your friend's loud talking is distracting you and others around you.</extra_info>)", "You need to express your thoughts and ideas but also want to respect the library rules and your friend's request (<extra_info>Extra information: You are naturally a loud talker and you are excited about the topic you're discussing.</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPM3NVVKSGCCB4S10465": {"pk": "01H7VFHPM3NVVKSGCCB4S10465", "codename": "mutual_friend_00005", "source": "mutual_friends", "scenario": "2 strangers are meeting at a party. <p viewer=\"environment\">They have 1 common friends: Rafael.</p>", "agent_goals": ["You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n David: Hobby: Vacation  Company: H. J. Heinz Company  Time Preference: evening  Location Preference: outdoor \n Christopher: Hobby: Go  Company: McKinsey & Company  Time Preference: evening  Location Preference: indoor \n Lee: Hobby: Go  Company: Groupon  Time Preference: evening  Location Preference: indoor \n Pamela: Hobby: Watching television  Company: General Cable  Time Preference: afternoon  Location Preference: indoor \n Phillip: Hobby: Kayaking  Company: Sauer-Danfoss  Time Preference: afternoon  Location Preference: outdoor \n Kristin: Hobby: Animal fancy  Company: H. J. Heinz Company  Time Preference: afternoon  Location Preference: indoor \n Rafael: Hobby: Kayaking  Company: General Cable  Time Preference: morning  Location Preference: indoor \n Chad: Hobby: Foreign language learning  Company: General Cable  Time Preference: evening  Location Preference: indoor \n Phil: Hobby: Kayaking  Company: H. J. Heinz Company  Time Preference: evening  Location Preference: outdoor \n Connie: Hobby: Animal fancy  Company: General Cable  Time Preference: afternoon  Location Preference: outdoor \n Tommy: Hobby: Animal fancy  Company: H. J. Heinz Company  Time Preference: morning  Location Preference: outdoor \n</extra_info>", "You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n Tina: Hobby: Lacemaking  Company: Groupon  Time Preference: morning  Location Preference: outdoor \n Rafael: Hobby: Kayaking  Company: General Cable  Time Preference: morning  Location Preference: indoor \n Wanda: Hobby: Weightlifting  Company: Sauer-Danfoss  Time Preference: morning  Location Preference: outdoor \n Raymond: Hobby: Foraging  Company: Chicago Bridge & Iron Company  Time Preference: morning  Location Preference: outdoor \n Ricky: Hobby: Foraging  Company: L. W. Seecamp Company  Time Preference: morning  Location Preference: outdoor \n Robert: Hobby: Foraging  Company: Lennox International  Time Preference: afternoon  Location Preference: indoor \n Frances: Hobby: Foraging  Company: Expedia  Time Preference: morning  Location Preference: indoor \n Scott: Hobby: Gaming  Company: Expedia  Time Preference: afternoon  Location Preference: indoor \n Helen: Hobby: Motor sports  Company: Union Bank  Time Preference: morning  Location Preference: outdoor \n Robin: Hobby: Gaming  Company: L. W. Seecamp Company  Time Preference: evening  Location Preference: outdoor \n James: Hobby: Vacation  Company: Urban Outfitters  Time Preference: morning  Location Preference: outdoor \n</extra_info>"], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHQ11NAMZS4A2RDGDB01V": {"pk": "01H7VFHQ11NAMZS4A2RDGDB01V", "codename": "craigslist_bargains_00007", "source": "craigslist_bargains", "scenario": "An individual is offering an Antique Oak Accent Table for sale at $60.00, while another is keen on purchasing it. The item is a magnificent antique oak parlor table, dating back to the late 1800s, making it a fantastic addition to any home or workspace. The table offers two levels, suitable for usage as an end table, a lamp table, or any other purpose. It's in top-notch condition, boasting a dark brown antique oak color and patina. The table is robust, with solid and strong joints, and it's free from marks, cracks, or damage. It features a 24-inch X 24-inch square top and a 16-inch X 18-inch lower shelf.", "agent_goals": ["You are the buyer for this item and your target price is $30.0. If you purchase it for a price significantly higher than this, you will incur a penalty. However, if you successfully manage to buy it for less than the target price, you will receive a bonus.", "You are the seller of this item, with a target price set at $58.6. Be aware that you may face penalties if you sell this item for a significantly lower than the target price. However, if you are successful in selling it above the target price, you will receive a bonus."], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPZMXNGV8PM19WHPQ2W3": {"pk": "01H7VFHPZMXNGV8PM19WHPQ2W3", "codename": "craigslist_bargains_00005", "source": "craigslist_bargains", "scenario": "One person has put up their Bell\\'O TV Stand - Black Glass and Wood Trim for sale at $125.0, while another person is showing interest in purchasing it. The item on sale is a beautiful 42\" Bell\\'O TV Stand, featuring black glass with an elegant wood trim. The stand measures 23 inches in height and 21 1/2 inches in depth.", "agent_goals": ["You are the buyer for this item and your target price is $112.00. Be aware that you may be penalized if you purchase it for a significantly higher price than the target. However, if you manage to buy it for less than the target price, you will receive a bonus.", "You are the seller for this item, and your target price is $76.9. Please be aware that you may face a penalty if the item is sold for a price significantly lower than the target price. However, a bonus will be rewarded if you manage to sell it for more than the target price."], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHND24JAWG23XMPYGG5HK": {"pk": "01H7VFHND24JAWG23XMPYGG5HK", "codename": "split_classes", "source": "social_chemistry", "scenario": "Two friends discussing their schedules at a coffee shop", "agent_goals": ["Convince the friend to take more classes (<extra_info>Extra information: you think your friend is not challenging themselves enough</extra_info>)", "Maintain a manageable schedule while preserving the friendship (<extra_info>Extra information: you are already overwhelmed with your current workload <strategy_hint>Hint: you can express your concerns about the workload and suggest other ways of challenging oneself.</strategy_hint></extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHN5WVC5HKKVBHZBA553R": {"pk": "01H7VFHN5WVC5HKKVBHZBA553R", "codename": "game_winning", "source": "social_chemistry", "scenario": "Two friends are playing a video game together", "agent_goals": ["Win the game (<extra_info>Extra information: you just need five more minutes to accomplish your goal in the game</extra_info>)", "Stop the game because it's too late (<extra_info>Extra information: you feel tired and need to go to bed early but don't want to upset your friend</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPQQQY6H4DNC6NBQ8XTG": {"pk": "01H7VFHPQQQY6H4DNC6NBQ8XTG", "codename": "craigslist_bargains_00000", "source": "craigslist_bargains", "scenario": "One person is selling a brand new 64GB Samsung Galaxy S8 in Midnight Black for $650, while another person is in the market to purchase it. Here\\'s what the seller has to say about the item: \"I have 6 brand new Samsung Galaxy S8 phones. I originally bought them for my company, but it turns out they weren\\'t needed. I\\'m willing to take a loss on them, and if you\\'re interested in buying more than one, I can offer an even better deal.\"", "agent_goals": ["You are the buyer for this item and the target price is set at $454.0. If you purchase it for a price significantly higher than the target, you'll face a penalty. However, if you manage to successfully negotiate a price lower than the target, you'll receive a bonus.", "You are the seller for this item. Your target price is $610.00. You will face penalties if you sell it for a price significantly lower than the target price. However, you will receive a bonus if you manage to sell it for a price higher than the target."], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHQ1Q67B1ADNBD9WBAG3X": {"pk": "01H7VFHQ1Q67B1ADNBD9WBAG3X", "codename": "craigslist_bargains_00008", "source": "craigslist_bargains", "scenario": "One person is selling a couch, loveseat, chair, and ottoman set for $550.0, while another person is keen to purchase it. The set of furniture is described as being incredibly comfortable. The seller's wife wishes to upgrade to a new, stiffer couch, hence the sale. Despite some light staining from life's little incidents, the set is in great condition. The comfort of the furniture is particularly emphasized by the seller.", "agent_goals": ["You are the buyer for this item, with a target price of $418.0. If you end up purchasing it for a price significantly higher than the target, you will be penalized. However, if you manage to acquire it for less than the target price, you will receive a bonus.", "As the seller for this item, your target price is set at $312.0. Please be aware that a penalty will be incurred if the item is sold for a price significantly below the target price. However, you will receive a bonus if you manage to sell it for more than the target price."], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNTHZAA4B5RWJ4T539F1": {"pk": "01H7VFHNTHZAA4B5RWJ4T539F1", "codename": "correct_misinformation", "source": "social_iqa", "scenario": "Two friends are sitting in the living room watching the history channel. One of them is upset because they believe the channel is getting a lot of historical details wrong.", "agent_goals": ["Correct the misinformation (<extra_info>Extra information: you are a history buff and have accurate knowledge about the topic being discussed on the channel.</extra_info>)", "Don't ruin the enjoyable TV watching experience but also acknowledge the friend's knowledge (<extra_info>Extra information: you are not much interested in history but enjoy the channel's presentation style and don't want the enjoyment to be ruined.</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNFVGFY578101R2PCV3T": {"pk": "01H7VFHNFVGFY578101R2PCV3T", "codename": "confess_mistake", "source": "social_chemistry", "scenario": "Conversation between two friends, one of whom has recently found out that the other friend has been involved with their long-term partner", "agent_goals": ["Confess to your friend that you have been involved with their long-term partner (<extra_info>Extra information: you have been involved with your friend's partner knowingly and want to come clean.</extra_info>)", "Maintain the friendship without causing a huge argument (<extra_info>Extra information: you don't want to lose a good friend over this.</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHP43QEZA1WZB3B3J2D9X": {"pk": "01H7VFHP43QEZA1WZB3B3J2D9X", "codename": "divide_things", "source": "deal-or-no-deal", "scenario": "Two roommates deciding on how to split up items after a garage sale. The items are 3 books, 2 hats, and 1 ball. Each item has a different sentimental value for each person, which translates into points.", "agent_goals": ["Maximize the points you have (<extra_info>Extra information: you value the books at 3 points each, the hats at 2 points each, and the ball at 1 point</extra_info>)", "Maximize the points you have (<extra_info>Extra information: you value the books at 2 points each, the hats at 3 points each, and the ball at 1 point</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNCN97BJ2PXKHJPX2VYY": {"pk": "01H7VFHNCN97BJ2PXKHJPX2VYY", "codename": "apology_and_acceptance", "source": "social_chemistry", "scenario": "Conversation between two friends who have known each other for a long time. One of them used to make fun of the other because English was not their first language.", "agent_goals": ["Apologize sincerely to your friend (<extra_info>Extra information: you used to make fun of your friend's English skills as they were learning the language. Now you regret your actions and want to apologize</extra_info>)", "Accept the apology but express the hurt caused by the actions (<extra_info>Extra information: you were hurt by your friend's actions and it affected your confidence</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPJKR16MD1KC71V4ZRCF": {"pk": "01H7VFHPJKR16MD1KC71V4ZRCF", "codename": "mutual_friend_00003", "source": "mutual_friends", "scenario": "2 strangers are meeting at a party. <p viewer=\"environment\">They have 1 common friends: Lawrence.</p>", "agent_goals": ["You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n Andrew: Hobby: Slot car racing  School: Mount Senario College  Major: Middle Eastern Languages  Company: Exxon \n Melissa: Hobby: Astronomy  School: Weber State University  Major: Hispanic-American Studies  Company: Hornbeck Offshore Services \n Anna: Hobby: Climbing  School: Valley City State University  Major: Middle Eastern Languages  Company: National Airlines \n Soledad: Hobby: Parkour  School: Valley City State University  Major: Biological Specializations  Company: Concur Technologies \n John: Hobby: Astronomy  School: Mount Senario College  Major: Fire Protection & Security  Company: Gibson Guitar Corporation \n Lawrence: Hobby: Sculling  School: University of Wisconsin-Milwaukee  Major: Hispanic-American Studies  Company: Leonard Green & Partners \n</extra_info>", "You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n Lawrence: Hobby: Sculling  School: University of Wisconsin-Milwaukee  Major: Hispanic-American Studies  Company: Leonard Green & Partners \n Kay: Hobby: Badminton  School: Black Hills State University  Major: Religious Education  Company: National Airlines \n Tanya: Hobby: Badminton  School: University of Illinois at Springfield  Major: Hispanic-American Studies  Company: ConverDyn \n Jason: Hobby: Badminton  School: Mount Senario College  Major: Senior High Education  Company: Vertex Pharmaceuticals \n Cristina: Hobby: Badminton  School: Mount Senario College  Major: Middle Eastern Languages  Company: Exxon \n Josef: Hobby: Curling  School: California State University, Northridge  Major: Middle Eastern Languages  Company: Concur Technologies \n</extra_info>"], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPRFCSA3BTT39BRBZX7H": {"pk": "01H7VFHPRFCSA3BTT39BRBZX7H", "codename": "craigslist_bargains_00001", "source": "craigslist_bargains", "scenario": "One person is offering a 47 inch LED TV for a price of $349.0, while another person is showing interest in purchasing it. Here is a description of the TV: This is a stunning 47 inch LED TV in pristine condition. The model is the LG M Series LM476700. The buyer will need to arrange for pick-up in San Ramon. Feel free to call or text if you\\'re interested. The TV is smart enabled with WIFI and has built-in apps like Netflix, Amazon, Youtube and more. It comes with a \"Magic Remote\" that has motion sensor controls. The LED display boasts 1080 HD resolution and also has a 3D function. The design is slim and lightweight with an attractive silver bezel.", "agent_goals": ["You are the buyer for this item and your target price is $174.00. Be aware that penalties apply if you purchase it for a price significantly higher than the target price. However, if you manage to buy it for less than the target price, you will receive a bonus.", "You are the seller for this item, with a target price set at $263.0. Should you sell it for a price substantially lower than this target, you will incur a penalty. However, achieving a sale at a price higher than the target will earn you a bonus."], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNHTF9NKPG4KW2Z4NBQJ": {"pk": "01H7VFHNHTF9NKPG4KW2Z4NBQJ", "codename": "emotional_support", "source": "social_chemistry", "scenario": "Two friends are having a conversation in a coffee shop", "agent_goals": ["Seek emotional support (<extra_info>Extra information: you have been feeling down lately and you need someone to talk to</extra_info>)", "Provide emotional support but also avoid enabling victim mentality (<extra_info>Extra information: you believe that your friend needs to face their problems instead of dwelling on them.</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNYABRSZYBFAJCK9NR1D": {"pk": "01H7VFHNYABRSZYBFAJCK9NR1D", "codename": "yell", "source": "normbank", "scenario": "Two roommates are having a disagreement over noise levels in their shared apartment.", "agent_goals": ["Convince your roommate to lower the noise (<extra_info>Extra information: you have an important online meeting tomorrow morning and you need a quiet environment to prepare</extra_info>)", "Defend your right to play music in your own room, but also keep the peace in the apartment (<extra_info>Extra information: you find playing music relaxing and it's your way to unwind after a long day. <strategy_hint>Hint: you may want to suggest a compromise, like using headphones or playing music only during certain hours.</strategy_hint></extra_info>)"], "relationship": 2, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHN3Q7498S3R4R2VDSXA0": {"pk": "01H7VFHN3Q7498S3R4R2VDSXA0", "codename": "prison_dilemma", "source": "hand-craft", "scenario": "Two criminals are arrested and placed in separate cells. The police have enough evidence to convict both criminals of a minor crime but need their confessions to establish evidence for a more serious crime. Now they get a chance to briefly chat with each during lunchtime.", "agent_goals": ["Minimize the jail year (<extra_info>Extra information: your lawyer told you that 1. if you report the other person, you would be free, the other person would go to jail for 10 years, and vice versa. 2. if both of you remain silent, you will only receive a fine. 3. If both of you reported each other, you both would go to jail for 10 years. <strategy_hint>Hint: You may want to share your information to reach mutual understanding</strategy_hint></extra_info>)", "Minimize the jail year (<extra_info>Extra information: your lawyer told you that 1. if you report the other person, you would be free, the other person would go to jail for 10 years, and vice versa. 2. if both of you remain silent, you will only receive a fine. 3. If both of you reported each other, you both would go to jail for 10 years. <strategy_hint>Hint: You may want to share your information to reach mutual understanding</strategy_hint></extra_info>)"], "relationship": 1, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPKA2GGPPNVJWV967HZC": {"pk": "01H7VFHPKA2GGPPNVJWV967HZC", "codename": "mutual_friend_00004", "source": "mutual_friends", "scenario": "2 strangers are meeting at a party. <p viewer=\"environment\">They have 1 common friends: Jacob.</p>", "agent_goals": ["You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n Chris: Hobby: Mountain biking  Company: Henry Schein, Inc.  \n Chester: Hobby: Surfing  Company: Maxim Integrated  \n Wendell: Hobby: Surfing  Company: Maxim Integrated  \n Demetrius: Hobby: Mountain biking  Company: Maxim Integrated  \n Jacob: Hobby: Shooting sport  Company: Maxim Integrated  \n</extra_info>", "You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends \n Joseph: Hobby: Shooting sport  Company: BP  \n Lillian: Hobby: Element collecting  Company: Gordon Food Service  \n Vivian: Hobby: Shooting sport  Company: Gordon Food Service  \n Murray: Hobby: Skateboarding  Company: BP  \n Jacob: Hobby: Shooting sport  Company: Maxim Integrated  \n</extra_info>"], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHP2XBZ6KDPGEAZ2FN1P2": {"pk": "01H7VFHP2XBZ6KDPGEAZ2FN1P2", "codename": "divide_things", "source": "deal-or-no-deal", "scenario": "Two friends are dividing their shared possessions after moving out from their shared apartment. They need to divide possessions, which include 4 books, 6 hats, and 2 balls. Each item has a different sentimental value for each person, which translates into points.", "agent_goals": ["Maximize the points they have (<extra_info>Extra information: you value the books at 3 points each, the hats at 2 points each, and the ball at 1 point</extra_info>)", "Maximize the points they have (<extra_info>Extra information: you value the books at 1 point each, the hats at 3 points each, and the ball at 2 points</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHN6NYWSTWCZJE2DCQKTD": {"pk": "01H7VFHN6NYWSTWCZJE2DCQKTD", "codename": "facetime_etiquettes", "source": "social_chemistry", "scenario": "A couple having a conversation over FaceTime", "agent_goals": ["Express feelings about the partner taking texts while on FaceTime (<extra_info>Extra information: You find it disrespectful and it makes you feel unimportant.</extra_info>)", "Justify the act of texting while on FaceTime without hurting the partner's feelings (<extra_info>Extra information: You have some urgent and important messages to respond to.</extra_info>)"], "relationship": 4, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHN7WJK7VWVRZZTQ6DX9T": {"pk": "01H7VFHN7WJK7VWVRZZTQ6DX9T", "codename": "join_trip", "source": "social_chemistry", "scenario": "Two friends are discussing their plans to go on a weekend trip", "agent_goals": ["Convince the friend to join the trip (<extra_info>Extra information: the trip will be more fun with more people, and you can share the expenses. <strategy_hint>Hint: you can provide some material benefits to persuade your friend to join.</strategy_hint></extra_info>)", "Decline the invitation to join the trip without upsetting the friend (<extra_info>Extra information: you had other plans for the weekend.</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPP9SPQ8W6583JFZ7HZC": {"pk": "01H7VFHPP9SPQ8W6583JFZ7HZC", "codename": "mutual_friend_00008", "source": "mutual_friends", "scenario": "2 strangers are meeting at a party. <p viewer=\"environment\">They have 1 common friends: Micheline.</p>", "agent_goals": ["You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n Melissa: Hobby: Card collecting  School: University of Texas Health Science Center at Houston  \n Orlando: Hobby: BASE jumping  School: St. Ambrose University  \n Steven: Hobby: Knitting  School: St. John's College-Santa Fe  \n Elizabeth: Hobby: Water sports  School: St. John's College-Santa Fe  \n Melaine: Hobby: Geocaching  School: University of Texas Health Science Center at Houston  \n Charles: Hobby: Ice hockey  School: Saint Joseph's University  \n Stephanie: Hobby: Card collecting  School: University of California, Davis  \n William: Hobby: Ice hockey  School: St. Ambrose University  \n Joe: Hobby: Blacksmithing  School: Saint Joseph's University  \n Micheline: Hobby: Shopping  School: University of Hartford  \n Dylan: Hobby: Card collecting  School: Tennessee State University  \n</extra_info>", "You are trying to figure out whether you have a mutual friend with the other person. You should not simply list their names.\n<extra_info> You know the following friends: \n Jacob: Hobby: Card collecting  School: Whittier College  \n Marjorie: Hobby: Foraging  School: University of Texas Health Science Center at Houston  \n Carrie: Hobby: Geocaching  School: Tennessee State University  \n Louis: Hobby: Shopping  School: Hesston College  \n Micheline: Hobby: Shopping  School: University of Hartford  \n Eva: Hobby: Geocaching  School: Hesston College  \n Johnnie: Hobby: Blacksmithing  School: University of Akron  \n John: Hobby: Foraging  School: University of California, Davis  \n Ronald: Hobby: Weightlifting  School: Indiana University at South Bend  \n Cynthia: Hobby: Lacrosse  School: Kansas State University  \n Robert: Hobby: Water sports  School: University of Akron  \n</extra_info>"], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHQ2EA3TTFZQ3M6DF3YCD": {"pk": "01H7VFHQ2EA3TTFZQ3M6DF3YCD", "codename": "craigslist_bargains_00009", "source": "craigslist_bargains", "scenario": "One person is offering an Italian Leather Loveseat for $50.0, while another person is showing interest to purchase it. The item is a full-sized loveseat, crafted from Italian leather in a faded burgandy color. It still has the original tags, and the current owner is the first and only owner. The loveseat is in good condition with no rips or tears, and all cushions are well preserved. The leather presents a charming faded look with various small scratches from the owner's cat, adding a touch of ruggedness perfect for a Man Cave. The transaction is strictly cash and carry as the owner does not offer delivery services.", "agent_goals": ["You are the designated buyer for this item and your target price is set at $46.0. If you purchase this item at a significantly higher price than the target, you would face a penalty. However, if you manage to buy it for less than the target price, you will receive a bonus.", "You are the seller for this item, with a target price of $26.5. You'll face a penalty if the item is sold significantly below this price. However, if you manage to sell it for more than the target price, a bonus will be your reward."], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNEEK6M3E96CT17AKDBD": {"pk": "01H7VFHNEEK6M3E96CT17AKDBD", "codename": "rekindle_relationship", "source": "social_chemistry", "scenario": "Conversation between two ex-lovers at a mutual friend's party", "agent_goals": ["Rekindle the romantic relationship (<extra_info>Extra information: You broke up three years ago but now you realize that you miss your ex-lover more than ever</extra_info>)", "Maintain emotional stability while considering the possibility of rekindling the relationship (<extra_info>Extra information: You have recently started feeling emotionally stable after the breakup and you don't want to rush into anything that might disturb that stability.</extra_info>)"], "relationship": 1, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPFYB1K1KMPZG7E31WDB": {"pk": "01H7VFHPFYB1K1KMPZG7E31WDB", "codename": "matching_donation", "source": "persuation_for_good", "scenario": "Two friends are at a charity event", "agent_goals": ["Convince your friend to donate to the charity. (<extra_info>Extra information: you have already donated $500, you want your friend to match your donation, but you know your friend would usually only donate half of your donation</extra_info>)", "Donate half of what your friend donated because you have financial constraints (<extra_info>Extra information: you only have $800 left for the month</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNXMZQ5Q61B3J4NNTC1A": {"pk": "01H7VFHNXMZQ5Q61B3J4NNTC1A", "codename": "disagree_on_movie", "source": "normbank", "scenario": "Two friends deciding on which movie to watch on a movie night.", "agent_goals": ["Insist on watching a thriller (<extra_info>Extra information: you have been looking forward to watching a new thriller movie that has just been released.</extra_info>)", "Persuade the friend to watch a comedy (<extra_info>Extra information: you do not like thrillers and would prefer to watch a comedy movie instead.</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNDRE1M02MKTPF0Q7CZA": {"pk": "01H7VFHNDRE1M02MKTPF0Q7CZA", "codename": "distance_friend", "source": "social_chemistry", "scenario": "Two friends having a conversation at a park", "agent_goals": ["Distance from a friend due to developing feelings and avoid letting them aware of your feelings (<extra_info>Extra information: you have developed romantic feelings for your friend and it's making you uncomfortable. You want to take a step back from the friendship to sort out your feelings <strategy_hint>Hint: you don't want to reveal your secretive feelings to them and you need to find other reasons</strategy_hint></extra_info>)", "Maintain the existing friendship (<extra_info>Extra information: you value your friendship with the friend and don't want to lose it. <strategy_hint>Hint: you want to understand the sudden change in their behavior.</strategy_hint></extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPEMV6QHBGM9J094FRM4": {"pk": "01H7VFHPEMV6QHBGM9J094FRM4", "codename": "financial_report", "source": "persuation_for_good", "scenario": "Conversation between two business partners reviewing their company's financial status (Gourmet Delights Inc. is globally recognized for producing and distributing a diverse line of exceptional quality food products.)", "agent_goals": ["Convince the partner to cut costs (<extra_info>Extra information: you have found a report indicating the company's profits are decreasing. And you think the company should start by switching suppliers of ingredients.</extra_info>  <strategy_hint>Hint: you can propose ways to cut costs that won't affect the status of the company.</strategy_hint>)", "Maintain the quality of the company's products and services while agreeing to a cost cut (<extra_info>Extra information: you are concerned about the impact of cost-cutting on the quality of your product.</extra_info>)"], "relationship": 2, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPS5WJW2694R1MNC8JFY": {"pk": "01H7VFHPS5WJW2694R1MNC8JFY", "codename": "craigslist_bargains_00002", "source": "craigslist_bargains", "scenario": "One person is offering a Dresser and Matching Night Stand for $200.00, while another person is showing interest in purchasing it. This set, which is from Crate & Barrel, is in decent condition. The dresser is missing one handle, however, the detached handle is still available and could potentially be re-attached.", "agent_goals": ["You are the buyer for this item and your target price is $152.0. You will be penalized if you purchase it at a significantly higher price than the target. However, if you manage to buy it for less than the target price, you'll receive a bonus.", "As the seller of this item, your target price is set at $172.5. Please be aware that you will face a penalty if the item is sold for a significantly lower price than the target. However, if you manage to sell it for more than the target price, you will receive a bonus."], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHP3DPGRXH1Y500VQKFZA": {"pk": "01H7VFHP3DPGRXH1Y500VQKFZA", "codename": "divide_things", "source": "deal-or-no-deal", "scenario": "Two friends are moving out of their shared apartment and need to divide their common possessions, which include 3 books, 2 hats, and 1 ball. Each item has a different sentimental value for each person, which translates into points.", "agent_goals": ["Maximize the points you have while dividing things fairly (<extra_info>Extra information: Books give you 5 points each, hats give you 3 points each, and the ball gives you 2 points.</extra_info>)", "Maximize the points you have while dividing things fairly (<extra_info>Extra information: Books give you 2 points each, hats give you 5 points each, and the ball gives you 3 points.</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHN7A1ZX5KSMT2YN9RXC4": {"pk": "01H7VFHN7A1ZX5KSMT2YN9RXC4", "codename": "sell_item", "source": "social_chemistry", "scenario": "Two friends at a garage sale", "agent_goals": ["Sell an item that isn't yours (<extra_info>Extra information: the item is a valuable vintage record that you mistakenly thought was yours.</extra_info>)", "Buy the item but also make sure the friend doesn't get into trouble (<extra_info>Extra information: You know the item actually belongs to another mutual friend.</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHP4TX1J43FS1QQJ1QFND": {"pk": "01H7VFHP4TX1J43FS1QQJ1QFND", "codename": "divide_things", "source": "deal-or-no-deal", "scenario": "Two roommates deciding on how to divide certain items that they bought together for their apartment. The items are 3 books, 2 hats, and 1 ball.  Each item has a different sentimental value for each person, which translates into points.", "agent_goals": ["Maximize the points you have (<extra_info>Extra information: For you, each book is worth 2 points, each hat is worth 3 points, and the ball is worth 5 points</extra_info>)", "Maximize the points you have (<extra_info>Extra information: For you, each book is worth 3 points, each hat is worth 2 points, and the ball is worth 4 points</extra_info>)"], "relationship": 2, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHQ0BGQA0AD9FC1R4M12F": {"pk": "01H7VFHQ0BGQA0AD9FC1R4M12F", "codename": "craigslist_bargains_00006", "source": "craigslist_bargains", "scenario": "One person is offering a BMW Z3 for $5000.0, while another individual is interested in purchasing it. Here's a brief description of the car: The BMW Z3 is in need of a good home. It operates smoothly without any problems and is known for its fuel efficiency and sporty appearance. The mileage is relatively low for its age. It's an opportunity not to be missed, so come and get it before it's gone. A smog certificate is readily available.", "agent_goals": ["You are the buyer for this item and your target price is $4600. You should be aware that if you purchase it at a price significantly higher than your target, you will incur a penalty. However, if you manage to secure it for less than the target price, you will receive a bonus.", "You are the seller of this item, with a target price set at $3260. Please note, you may face a penalty if this item is sold for a price significantly lower than the target. However, you stand a chance to earn a bonus if you successfully sell it for a price higher than the target."], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHP29TCH457PBDVF7WFDS": {"pk": "01H7VFHP29TCH457PBDVF7WFDS", "codename": "drink_less", "source": "normbank", "scenario": "Two friends meet at a bar", "agent_goals": ["Convince the friend to drink less (<extra_info>Extra information: your friend has been drinking a lot recently and you're worried about their health</extra_info>)", "You want to keep drinking but don't want to upset your friend (<extra_info>Extra information: you've been drinking to cope with stress recently, but don't want to worry your friend</extra_info>)"], "relationship": 3, "age_constraint": "[(21, 70), (21, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHP6XZVT1P4R7YKAH65HJ": {"pk": "01H7VFHP6XZVT1P4R7YKAH65HJ", "codename": "divide_things", "source": "deal-or-no-deal", "scenario": "Two friends are having a picnic. They have 3 apples, 2 bananas, and 1 orange they need to share among them. Each person has a different preference for fruit, which translates into points.", "agent_goals": ["Maximize the points you have (<extra_info>Extra information: For you, an apple is worth 1 point, a banana is worth 2 points, and an orange is 3 points</extra_info>)", "Maximize the points you have (<extra_info>Extra information: For you, an apple is worth 2 points, a banana is worth 1 point, and an orange is 3 points</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNAH7V4JNA0705SF36Y1": {"pk": "01H7VFHNAH7V4JNA0705SF36Y1", "codename": "food_refusal", "source": "social_chemistry", "scenario": "Two roommates living together and sharing household chores. One of them, who is responsible for cooking, finds out that the other one refuses to eat anything they cook", "agent_goals": ["Convince the roommate to try the food (<extra_info>Extra information: you have spent a lot of time and effort on cooking</extra_info>)", "Express your concerns about the food without hurting the roommate's feelings (<extra_info>Extra information: you are worried about the taste and nutrition of the food</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPDE1AM74JSR8KBJJF3A": {"pk": "01H7VFHPDE1AM74JSR8KBJJF3A", "codename": "donate_to_cause", "source": "persuation_for_good", "scenario": "A conversation between two individuals at a charity gala", "agent_goals": ["Convince the other individual to donate to a cause supporting young children (<extra_info>Extra information: this cause can greatly improve the lives of many young children and you think it is a worthy cause. The minimum donation for this charity organization is $3000</extra_info>)", "Maintain financial stability while supporting causes (<extra_info>Extra information: you have a certain budget for donations this year and have already made several donations. You are only thinking of donating $2000 max</extra_info>)"], "relationship": 2, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPCKKZNRD5G8CKPR8WE5": {"pk": "01H7VFHPCKKZNRD5G8CKPR8WE5", "codename": "donate_charity", "source": "persuation_for_good", "scenario": "Two friends are sitting in a coffee shop when a representative from a charity organization approaches them", "agent_goals": ["Get the friend to donate $1 a day to a charity organization (<extra_info>Extra information: you are a passionate supporter of the charity (about children's cancer) and believe that a small donation can make a big impact. $1 a day works as simple as signing up the project on an website and one can cancel anytime</extra_info>)", "Donate to the charity but not sure about how $1 a day works (<extra_info>Extra information: you're currently on a tight budget, but you also want to support the charity. </extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHPTKDPQ5PZWA1M1XHT1M": {"pk": "01H7VFHPTKDPQ5PZWA1M1XHT1M", "codename": "craigslist_bargains_00004", "source": "craigslist_bargains", "scenario": "One person is offering an Antique Chair for $15.0, while another person is interested in purchasing it. Here's what you need to know about the item: it's a beautifully carved antique wooden chair. It's in good condition, but could probably benefit from a fresh seat cushion.", "agent_goals": ["You are the buyer for this item, and your target price is $9.0. If you purchase it at a significantly higher price, be aware that you will incur a penalty. However, if you manage to buy it for less than the target price, you will receive a bonus.", "You are the seller for this item and your target price is $8. You should be aware that if you sell it for a price significantly lower than the target price, you will incur a penalty. However, if you manage to sell it for more than the target price, you stand to receive a bonus."], "relationship": 0, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNMHDJ8T9Q6F9S3E8XZC": {"pk": "01H7VFHNMHDJ8T9Q6F9S3E8XZC", "codename": "drive_sportscar", "source": "social_iqa", "scenario": "Two friends hanging out, one of them just got a new sports car and is excited to show it off.", "agent_goals": ["Drive the sports car and show off to friend (<extra_info>Extra information: you are very excited about your new car and can't wait for your friend to see it.</extra_info>)", "You want to drive the new sports car but also respect your friend's feelings (<extra_info>Extra information: you are a car enthusiast and have been dreaming to drive a sports car, but you also don't want to make your friend feel uncomfortable</extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}, "01H7VFHNBBK14NGV72BWXEXXJC": {"pk": "01H7VFHNBBK14NGV72BWXEXXJC", "codename": "play_rights", "source": "social_chemistry", "scenario": "Conversation between two friends, one who has written a play based on their parents' life, and the other owns a production company.", "agent_goals": ["Sell the rights of the play to your friend (<extra_info>Extra information: you believe that the play is worth a lot and you would like a fair price for it</extra_info>)", "Acquire the rights of the play while maintaining a budget (<extra_info>Extra information: you only have a limited budget for new plays this season. <strategy_hint>Hint: you can not spend all your budget on this play since you still need to maintain your financial stability.</strategy_hint></extra_info>)"], "relationship": 3, "age_constraint": "[(18, 70), (18, 70)]", "occupation_constraint": "nan", "agent_constraint": null}}